#ifndef SETTINGS_H
#define SETTINGS_H

//****************************************************************************************************
//настройки
//****************************************************************************************************


//использовать CPU вместо CUDA
//#define USE_CPU

//использовать тензорные ядра первого поколения
#define USE_TENSOR_CORE_GENERATION_ONE
//использовать ли генерацию случайных чисел с нормальным распределением для диффузионной сети на GPU (на многих картах будет сильно медленнее, чем на CPU)
//#define USE_GPU_NORMAL_RANDOM_GENERATOR_FOR_DIFFUSION_NET

#endif
