#ifndef SETTINGS_H
#define SETTINGS_H

//****************************************************************************************************
//настройки
//****************************************************************************************************


//использовать CPU вместо CUDA
//#define USE_CPU

//использовать тензорные ядра первого поколения
#define USE_TENSOR_CORE_GENERATION_ONE
//использовать ли генерацию случайных чисел с нормальным распределением для диффузионной сети на GPU (может быть медленнее, чем на CPU)
#define USE_GPU_NORMAL_RANDOM_GENERATOR_FOR_DIFFUSION_NET
//использовать ли генерацию случайных чисел на GPU (может быть медленнее, чем на CPU)
#define USE_GPU_RANDOM_GENERATOR

//использовать цветовую модель LAB
#define USE_COLOR_MODEL_LAB

#endif
