#ifndef C_TENSOR_SUM_H
#define C_TENSOR_SUM_H

//****************************************************************************************************
//Операции суммирования над тензорами произвольной размерности
//****************************************************************************************************

//****************************************************************************************************
//подключаемые библиотеки
//****************************************************************************************************
#include "ctensor.h"
#include "ctensormath.h"
#include <vector>

//****************************************************************************************************
//макроопределения
//****************************************************************************************************

//****************************************************************************************************
//константы
//****************************************************************************************************

//****************************************************************************************************
//предварительные объявления
//****************************************************************************************************

//****************************************************************************************************
//прототипы функций
//****************************************************************************************************


//****************************************************************************************************
///!Операции суммирования над тензорами произвольной размерности
//****************************************************************************************************

template<class type_t>
class CTensorSum
{
 public:
  //-перечисления---------------------------------------------------------------------------------------
  //-структуры------------------------------------------------------------------------------------------
  //-константы------------------------------------------------------------------------------------------
 private:
  //-переменные-----------------------------------------------------------------------------------------
 public:
  //-конструктор----------------------------------------------------------------------------------------
  //-конструктор копирования----------------------------------------------------------------------------
  //-деструктор-----------------------------------------------------------------------------------------
 public:
  //-открытые функции-----------------------------------------------------------------------------------
  static void AddSumW(CTensor<type_t> &cTensor_Output,const CTensor<type_t> &cTensor_Left,const CTensor<type_t> &cTensor_Right,type_t left_scale=1,type_t right_scale=1);///<сложить тензоры по координате W
  static void SumXY(CTensor<type_t> &cTensor_Output,CTensor<type_t> &cTensor_Input,type_t scale=1);///<вычислить сумму элементов по X и Y для каждого Z
  static void AddSumX(CTensor<type_t> &cTensor_Output,CTensor<type_t> &cTensor_Input_A,CTensor<type_t> &cTensor_Input_B);///<сложить в слой X слои Y,Z,W
 private:
  //-закрытые функции-----------------------------------------------------------------------------------
};

//****************************************************************************************************
//реализация функций
//****************************************************************************************************

//****************************************************************************************************
//открытые функции
//****************************************************************************************************

//----------------------------------------------------------------------------------------------------
//сложить тензоры по координате W
//----------------------------------------------------------------------------------------------------
template<class type_t>
void CTensorSum<type_t>::AddSumW(CTensor<type_t> &cTensor_Output,const CTensor<type_t> &cTensor_Left,const CTensor<type_t> &cTensor_Right,type_t left_scale,type_t right_scale)
{
 if (cTensor_Left.Size_X!=cTensor_Right.Size_X || cTensor_Left.Size_Y!=cTensor_Right.Size_Y || cTensor_Left.Size_Z!=cTensor_Right.Size_Z ||
     cTensor_Output.Size_X!=cTensor_Right.Size_X || cTensor_Output.Size_Y!=cTensor_Right.Size_Y || cTensor_Output.Size_Z!=cTensor_Right.Size_Z)
 {
  throw "CTensor::AddSumW: Размерности тензоров не совпадают!";
 }

 for(uint32_t z=0;z<cTensor_Left.Size_Z;z++)
 {
  for(uint32_t y=0;y<cTensor_Left.Size_Y;y++)
  {
   for(uint32_t x=0;x<cTensor_Left.Size_X;x++)
   {
    type_t summ_left=0;
    type_t summ_right=0;
    for(uint32_t w=0;w<cTensor_Left.Size_W;w++)
    {
     type_t v=cTensor_Left.GetElement(w,z,y,x);
     summ_left+=v;
    }
    summ_left*=left_scale;
    for(uint32_t w=0;w<cTensor_Right.Size_W;w++)
    {
     type_t v=cTensor_Right.GetElement(w,z,y,x);
     summ_right+=v;
    }
    summ_right*=right_scale;
    type_t summ_output=summ_left+summ_right;
    cTensor_Output.SetElement(0,z,y,x,summ_output);//помещаем сумму в нулевой слой w
    for(uint32_t w=1;w<cTensor_Output.Size_W;w++) cTensor_Output.SetElement(w,z,y,x,0);//все остальные слои w обнулены
   }
  }
 }
}

//----------------------------------------------------------------------------------------------------
//вычислить сумму элементов по X и Y для каждого Z
//----------------------------------------------------------------------------------------------------
template<class type_t>
void CTensorSum<type_t>::SumXY(CTensor<type_t> &cTensor_Output,CTensor<type_t> &cTensor_Input,type_t scale)
{
 if (cTensor_Input.Size_Z!=cTensor_Output.Size_Z || cTensor_Input.Size_W!=cTensor_Output.Size_W)
 {
  throw "CTensor::SumXY: Размерности тензоров не совпадают!";
 }
 if (cTensor_Output.Size_X!=1 || cTensor_Output.Size_Y!=1)
 {
  throw "CTensor::SumXY: Размерность выходного тензора по x и y должна быть 1!";
 }

 uint32_t input_w=cTensor_Input.Size_W;
 uint32_t output_w=cTensor_Output.Size_W;

 for(uint32_t w=0;w<cTensor_Output.Size_W;w++)
 {
  uint32_t w_input=w%input_w;
  uint32_t w_output=w%output_w;
  for(uint32_t z=0;z<cTensor_Input.Size_Z;z++)
  {
   type_t summ=0;
   for(uint32_t y=0;y<cTensor_Input.Size_Y;y++)
   {
    for(uint32_t x=0;x<cTensor_Input.Size_X;x++)
    {
     type_t e=cTensor_Input.GetElement(w_input,z,y,x);
     summ+=e;
    }
   }
   summ*=scale;
   cTensor_Output.SetElement(w_output,z,0,0,summ);
  }
 }
}




#endif
