#ifndef C_TENSOR_ADAM_H
#define C_TENSOR_ADAM_H

//****************************************************************************************************
//Операции алгоритма Adam над тензорами произвольной размерности
//****************************************************************************************************

//****************************************************************************************************
//подключаемые библиотеки
//****************************************************************************************************
#include "ctensor.h"
#include "ctensormath.h"
#include <vector>

//****************************************************************************************************
//макроопределения
//****************************************************************************************************

//****************************************************************************************************
//константы
//****************************************************************************************************

//****************************************************************************************************
//предварительные объявления
//****************************************************************************************************

//****************************************************************************************************
//прототипы функций
//****************************************************************************************************


//****************************************************************************************************
///!Операции алгоритма Adam над тензорами произвольной размерности
//****************************************************************************************************

template<class type_t>
class CTensorAdam
{
 public:
  //-перечисления---------------------------------------------------------------------------------------
  //-структуры------------------------------------------------------------------------------------------
  //-константы------------------------------------------------------------------------------------------
 private:
  //-переменные-----------------------------------------------------------------------------------------
 public:
  //-конструктор----------------------------------------------------------------------------------------
  //-конструктор копирования----------------------------------------------------------------------------
  //-деструктор-----------------------------------------------------------------------------------------
 public:
  //-открытые функции-----------------------------------------------------------------------------------
  static void Adam(CTensor<type_t> &cTensor_Weight,CTensor<type_t> &cTensor_dWeight,CTensor<type_t> &cTensor_M,CTensor<type_t> &cTensor_V,uint32_t batch_size,double speed,double beta1,double beta2,double epsilon,double iteration);///<выполнить алгоритм Adam к весовому тензору
 private:
  //-закрытые функции-----------------------------------------------------------------------------------
};

//****************************************************************************************************
//реализация функций
//****************************************************************************************************

//****************************************************************************************************
//открытые функции
//****************************************************************************************************

//----------------------------------------------------------------------------------------------------
//!выполнить алгоритм Adam к весовому тензору
//----------------------------------------------------------------------------------------------------
template<class type_t>
void CTensorAdam<type_t>::Adam(CTensor<type_t> &cTensor_Weight,CTensor<type_t> &cTensor_dWeight,CTensor<type_t> &cTensor_M,CTensor<type_t> &cTensor_V,uint32_t batch_size,double speed,double beta1,double beta2,double epsilon,double iteration)
{
 if (cTensor_Weight.Size_X!=cTensor_dWeight.Size_X || cTensor_Weight.Size_Y!=cTensor_dWeight.Size_Y || cTensor_Weight.Size_Z!=cTensor_dWeight.Size_Z || cTensor_Weight.Size_W!=cTensor_dWeight.Size_W ||
     cTensor_Weight.Size_X!=cTensor_M.Size_X || cTensor_Weight.Size_Y!=cTensor_M.Size_Y || cTensor_Weight.Size_Z!=cTensor_M.Size_Z || cTensor_Weight.Size_W!=cTensor_M.Size_W ||
     cTensor_Weight.Size_X!=cTensor_V.Size_X || cTensor_Weight.Size_Y!=cTensor_V.Size_Y || cTensor_Weight.Size_Z!=cTensor_V.Size_Z || cTensor_Weight.Size_W!=cTensor_V.Size_W)
 {
  throw "CTensor::Adam: Размерности тензоров не совпадают!";
 }

 uint32_t size_y=cTensor_Weight.Size_Y;
 uint32_t size_x=cTensor_Weight.Size_X;
 uint32_t size_z=cTensor_Weight.Size_Z;
 uint32_t size_w=cTensor_Weight.Size_W;

 for(uint32_t w=0;w<size_w;w++)
 {
  for(uint32_t z=0;z<size_z;z++)
  {
   for(uint32_t y=0;y<size_y;y++)
   {
    for(uint32_t x=0;x<size_x;x++)
    {

     type_t dw=cTensor_dWeight.GetElement(w,z,y,x);
     type_t m=cTensor_M.GetElement(w,z,y,x);
     type_t v=cTensor_V.GetElement(w,z,y,x);

     dw/=static_cast<type_t>(batch_size);

     m=beta1*m+(1.0-beta1)*dw;
     v=beta2*v+(1.0-beta2)*dw*dw;

     type_t mc=m/(1.0-pow(beta1,iteration));
     type_t vc=v/(1.0-pow(beta2,iteration));

     dw=speed*mc/(sqrt(vc)+epsilon);

     cTensor_M.SetElement(w,z,y,x,m);
     cTensor_V.SetElement(w,z,y,x,v);
     //корректируем веса
     type_t wc=cTensor_Weight.GetElement(w,z,y,x);
     cTensor_Weight.SetElement(w,z,y,x,wc-dw);
    }
   }
  }
 }
}


#endif
