#ifndef C_TENSOR_ATTENTION_H
#define C_TENSOR_ATTENTION_H

//****************************************************************************************************
//Операции внимания над тензорами произвольной размерности
//****************************************************************************************************

//****************************************************************************************************
//подключаемые библиотеки
//****************************************************************************************************
#include "ctensor.h"
#include "ctensormath.h"
#include <vector>

//****************************************************************************************************
//макроопределения
//****************************************************************************************************

//****************************************************************************************************
//константы
//****************************************************************************************************

//****************************************************************************************************
//предварительные объявления
//****************************************************************************************************

//****************************************************************************************************
//прототипы функций
//****************************************************************************************************


//****************************************************************************************************
///!Операции внимания над тензорами произвольной размерности
//****************************************************************************************************

template<class type_t>
class CTensorAttention
{
 public:
  //-перечисления---------------------------------------------------------------------------------------
  //-структуры------------------------------------------------------------------------------------------
  //-константы------------------------------------------------------------------------------------------
 private:
  //-переменные-----------------------------------------------------------------------------------------
 public:
  //-конструктор----------------------------------------------------------------------------------------
  //-конструктор копирования----------------------------------------------------------------------------
  //-деструктор-----------------------------------------------------------------------------------------
 public:
  //-открытые функции-----------------------------------------------------------------------------------
  static void SplitKQVTensor(CTensor<type_t> &cTensor_Q,CTensor<type_t> &cTensor_K,CTensor<type_t> &cTensor_V,const CTensor<type_t> &cTensor_QKV,int32_t num_total_tokens,int32_t head_dim,int32_t arch_dim,int32_t q_split_index,int32_t k_split_index,int32_t v_split_index);//разделить тензор на Q,K,V
  static void SetCausalMask(CTensor<type_t> &cTensor);///<нанести каузальную маску на тензор
  static void AttentionUnion(CTensor<type_t> &cTensor_Output,const CTensor<type_t> &cTensor_Input);///<объединение для слоя внимания
  static void MulAttentionTranspose(CTensor<type_t> &cTensor_Output,const CTensor<type_t> &cTensor_X,const CTensor<type_t> &cTensor_W,const CTensor<type_t> &cTensor_B);///<умножить тензоры для слоя внимания
  static void AttentionBackward_dV_dP(CTensor<type_t> &cTensor_dVh,CTensor<type_t> &cTensor_dP,const CTensor<type_t> &cTensor_Vh,const CTensor<type_t> &cTensor_SoftMax,const CTensor<type_t> &cTensor_Delta,int32_t head_dimension);///<получение dV и dP для обратного проход слоя внимания
  static void AttentionBackward_dQ_dK_dV(CTensor<type_t> &cTensor_dQ,CTensor<type_t> &cTensor_dK,CTensor<type_t> &cTensor_dV,const CTensor<type_t> &cTensor_dQh,const CTensor<type_t> &cTensor_dKh,const CTensor<type_t> &cTensor_dVh);///<перестановка осей для обратного прохода слоя внимания
 private:
  //-закрытые функции-----------------------------------------------------------------------------------
};

//****************************************************************************************************
//реализация функций
//****************************************************************************************************

//****************************************************************************************************
//открытые функции
//****************************************************************************************************

//----------------------------------------------------------------------------------------------------
//разделить тензор на Q,K,V
//----------------------------------------------------------------------------------------------------
template<class type_t>
void CTensorAttention<type_t>::SplitKQVTensor(CTensor<type_t> &cTensor_Q,CTensor<type_t> &cTensor_K,CTensor<type_t> &cTensor_V,const CTensor<type_t> &cTensor_QKV,int32_t num_total_tokens,int32_t head_dim,int32_t arch_dim,int32_t q_split_index,int32_t k_split_index,int32_t v_split_index)
{
 for(int32_t w=0;w<cTensor_K.Size_W;w++)
 {
  uint32_t wp=w;
  for(int32_t z=0;z<cTensor_K.Size_Z;z++)
  {
   uint32_t zp=z;
   for(int32_t y=0;y<cTensor_K.Size_Y;y++)
   {
    uint32_t yp=y;
    for(uint32_t x=0;x<cTensor_K.Size_X;x++)
    {
     uint32_t xp=x;
     type_t q=0;
     type_t k=0;
     type_t v=0;
     if (yp<num_total_tokens)
     {
      q=cTensor_QKV.GetElement(wp,0,yp,q_split_index*arch_dim+zp*head_dim+xp);
      k=cTensor_QKV.GetElement(wp,0,yp,k_split_index*arch_dim+zp*head_dim+xp);
      v=cTensor_QKV.GetElement(wp,0,yp,v_split_index*arch_dim+zp*head_dim+xp);
     }
     cTensor_Q.SetElement(wp,zp,yp,xp,q);
     cTensor_K.SetElement(wp,zp,yp,xp,k);
     cTensor_V.SetElement(wp,zp,yp,xp,v);
    }
   }
  }
 }
}

#endif
