#ifndef C_TENSOR_RANDOM_H
#define C_TENSOR_RANDOM_H

//****************************************************************************************************
//Операции со случайными числами над тензорами произвольной размерности
//****************************************************************************************************

//****************************************************************************************************
//подключаемые библиотеки
//****************************************************************************************************
#include "ctensor.h"
#include "ctensormath.h"
#include <vector>

//****************************************************************************************************
//макроопределения
//****************************************************************************************************

//****************************************************************************************************
//константы
//****************************************************************************************************

//****************************************************************************************************
//предварительные объявления
//****************************************************************************************************

//****************************************************************************************************
//прототипы функций
//****************************************************************************************************


//****************************************************************************************************
///!Операции со случайными числамия над тензорами произвольной размерности
//****************************************************************************************************

template<class type_t>
class CTensorRandom
{
 public:
  //-перечисления---------------------------------------------------------------------------------------
  //-структуры------------------------------------------------------------------------------------------
  //-константы------------------------------------------------------------------------------------------
 private:
  //-переменные-----------------------------------------------------------------------------------------
 public:
  //-конструктор----------------------------------------------------------------------------------------
  //-конструктор копирования----------------------------------------------------------------------------
  //-деструктор-----------------------------------------------------------------------------------------
 public:
  //-открытые функции-----------------------------------------------------------------------------------
  static void CreateDropOutMatrix(CTensor<type_t> &cTensor_Output,type_t drop_out);///<создать матрицу исключения
  static void SetNormalNoise(CTensor<type_t> &cTensor_Output);///<задать тензор случайными значениями с нормальным распределением
  static void GetNoiseImageAndNoise(CTensor<type_t> &cTensor_NoisyImage,CTensor<type_t> &cTensor_Noise,const CTensor<type_t> &cTensor_Image,const CTensor<type_t> &cTensor_SqrtAlphaBar,const CTensor<type_t> &cTensor_SqrtOneMinusAlphaBar);///<заполнить тензоры зашумлённым изображением и шумом
 private:
  //-закрытые функции-----------------------------------------------------------------------------------
};

//****************************************************************************************************
//реализация функций
//****************************************************************************************************

//****************************************************************************************************
//открытые функции
//****************************************************************************************************

//----------------------------------------------------------------------------------------------------
//!создать матрицу исключения
//----------------------------------------------------------------------------------------------------
template<class type_t>
void CTensorRandom<type_t>::CreateDropOutMatrix(CTensor<type_t> &cTensor_Output,type_t drop_out)
{
 //создаём матрицу исключения
 Fill(cTensor_Output,0);
 type_t mult=static_cast<type_t>(1.0/(1.0-drop_out));
 for(uint32_t w=0;w<cTensor_Output.Size_W;w++)
 {
  for(uint32_t z=0;z<cTensor_Output.Size_Z;z++)
  {
   for(uint32_t y=0;y<cTensor_Output.Size_Y;y++)
   {
    for(uint32_t x=0;x<cTensor_Output.Size_X;x++)
    {
     if (CRandom<type_t>::GetRandValue(1)>=drop_out) cTensor_Output.SetElement(w,z,y,x,mult);
    }
   }
  }
 }
}
//----------------------------------------------------------------------------------------------------
//!задать тензор случайными значениями с нормальным распределением
//----------------------------------------------------------------------------------------------------
template<class type_t>
void CTensorRandom<type_t>::SetNormalNoise(CTensor<type_t> &cTensor_Output)
{
 throw("Функция SetNormalNoise из CTensorMath не должна вызываться при компиляции для CPU. Отключите макрос активации заполнения тензора на GPU!");
}
//----------------------------------------------------------------------------------------------------
//!заполнить тензоры зашумлённым изображением и шумом
//----------------------------------------------------------------------------------------------------
template<class type_t>
void CTensorRandom<type_t>::GetNoiseImageAndNoise(CTensor<type_t> &cTensor_NoisyImage,CTensor<type_t> &cTensor_Noise,const CTensor<type_t> &cTensor_Image,const CTensor<type_t> &cTensor_SqrtAlphaBar,const CTensor<type_t> &cTensor_SqrtOneMinusAlphaBar)
{
 throw("Функция GetNoiseImageAndNoise из CTensorMath не должна вызываться при компиляции для CPU. Отключите макрос активации заполнения тензора на GPU!");
}



#endif
