#ifndef C_TENSOR_TIME_H
#define C_TENSOR_TIME_H

//****************************************************************************************************
//Операции наложения временного шага над тензорами произвольной размерности
//****************************************************************************************************

//****************************************************************************************************
//подключаемые библиотеки
//****************************************************************************************************
#include "ctensor.h"
#include "ctensormath.h"
#include <vector>

//****************************************************************************************************
//макроопределения
//****************************************************************************************************

//****************************************************************************************************
//константы
//****************************************************************************************************

//****************************************************************************************************
//предварительные объявления
//****************************************************************************************************

//****************************************************************************************************
//прототипы функций
//****************************************************************************************************


//****************************************************************************************************
///!Операции наложения временного шага над тензорами произвольной размерности
//****************************************************************************************************

template<class type_t>
class CTensorTime
{
 public:
  //-перечисления---------------------------------------------------------------------------------------
  //-структуры------------------------------------------------------------------------------------------
  //-константы------------------------------------------------------------------------------------------
 private:
  //-переменные-----------------------------------------------------------------------------------------
 public:
  //-конструктор----------------------------------------------------------------------------------------
  //-конструктор копирования----------------------------------------------------------------------------
  //-деструктор-----------------------------------------------------------------------------------------
 public:
  //-открытые функции-----------------------------------------------------------------------------------
  static void SetTimeStep(CTensor<type_t> &cTensor_Output,const CTensor<type_t> &cTensor_Input,const CTensor<uint32_t> &cTensor_TimeStep,type_t scale);///<добавить к тензору временной шаг
 private:
  //-закрытые функции-----------------------------------------------------------------------------------
};

//****************************************************************************************************
//реализация функций
//****************************************************************************************************

//****************************************************************************************************
//открытые функции
//****************************************************************************************************


//TODO: сравнить функцию с CUDA-вариантом!

//----------------------------------------------------------------------------------------------------
//!добавить к тензору временной шаг
//----------------------------------------------------------------------------------------------------
template<class type_t>
void CTensorTime<type_t>::SetTimeStep(CTensor<type_t> &cTensor_Output,const CTensor<type_t> &cTensor_Input,const CTensor<uint32_t> &cTensor_TimeStep,type_t scale)
{
 if (cTensor_Input.Size_X!=cTensor_Output.Size_X || cTensor_Input.Size_Y!=cTensor_Output.Size_Y || cTensor_Input.Size_Z!=cTensor_Output.Size_Z ||
     cTensor_Input.Size_W!=cTensor_Output.Size_W || cTensor_TimeStep.Size_W!=cTensor_Input.Size_W || cTensor_TimeStep.Size_X!=1 ||
     cTensor_TimeStep.Size_Y!=1 || cTensor_TimeStep.Size_Z!=1)
 {
  throw "CTensor::SetTimeStep: Размерности тензоров не совпадают!";
 }

 const uint32_t C=cTensor_Input.Size_Z;//число каналов
 for(uint32_t w=0;w<cTensor_Input.Size_Z;w++)
 {
  //шаг времени для данного элемента пакета (w — индекс картинки в батче)
  type_t time_step=static_cast<type_t>(cTensor_TimeStep.GetElement(w,0,0,0));
  for(uint32_t z=0;z<cTensor_Input.Size_Z;z++)
  {
   //Временное кодирование: зависит только от z и t
   const uint32_t i=z/2;//индекс "полупары" sin/cos
   const type_t exponent=static_cast<type_t>(2*i)/static_cast<type_t>(C);
   const type_t freq=pow(10000.0f,exponent);
   const type_t angle=time_step/freq;
   for(uint32_t y=0;y<cTensor_Input.Size_Y;y++)
   {
    for(uint32_t x=0;x<cTensor_Input.Size_X;x++)
    {
     type_t emb_z;
     if ((z & 0x01)==0) emb_z=sin(angle)*scale;//чётный канал
                   else emb_z=cos(angle)*scale;//нечётный канал
     //добавление одинакового значения ко всем пикселям канала z
     type_t value=cTensor_Input.GetElement(w,z,y,x);
     value+=emb_z;
     cTensor_Output.SetElement(w,z,y,x,value);
    }
   }
  }
 }
}

#endif
